# **End of Phase 1 Project Submission.**

* Student Name: PETER NJUGU MURAGE.
* Student Pace: Part Time.

### This Project is designed to test my understanding in Phase 0 and Phase 1 content of Data Science Course.

### Specifically, this will cover:
     1. Business Understanding.
     2. Data Understanding.
     3. Data Exploration.
     4. Data Cleaning.
     5. Data Analysis.
     6. Data Visualization.

## **Project Overview.**

My main task in this poject is to use Exploratory Data Analysis to generate insights for MicroSoft to help them make an informed decision as they venture in creating a new movie studio. I will be exploring various datasets such as The Numbers and Rotten Tomatoes. I will also perform several visualizations to enable me make reommendation that will in turn help Microsoft decide on what type of movie to create.

## **Business Understanding/Problem.**

Microsoft want to create a new movie studio. They are unsure on where to start. I will be exploring on what type of films are currently doing the best at the Box office. This will enable me to make recommendations about attributes that Microsoft's movies should have in order to attain the highest revenue.

### I will base my analysis on the following factors;
1. Movie genre: What type of movie content are currently most successful?
2. Production budget: What budget amount tends to achieve the highest box office gross?
3. Released date: When is the best time of the year to release a movie?

## **Data Understanding.**

##### I utilized three different data sources for my analysis in order to have the most comprehensive view of the industry as it currently is.
### These data sets include
1. **The Numbers** - 
2. **Rotten Tomatoes** -

![Screenshot (2).png](<attachment:Screenshot (2).png>)

![Screenshot (3).png](<attachment:Screenshot (3).png>)

In [36]:
#Importing Relevant Python Libraries.

import pandas as pd
import numpy as np
import seaborn as sn
import matplotlib.pyplot as plt
import sqlite3
import os

%matplotlib inline

### Reading the Data

### **1. The Numbers Dataset.**

In [51]:
#reading the csv file.
df_TheNumbers = pd.read_csv('datasets/tn.movie_budgets.csv')
#displaying the first ten rows of the dataframe.
df_TheNumbers.head(10)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,053,311,220"
6,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200"
7,8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,"$300,000,000","$309,420,425","$963,420,425"
8,9,"Nov 17, 2017",Justice League,"$300,000,000","$229,024,295","$655,945,209"
9,10,"Nov 6, 2015",Spectre,"$300,000,000","$200,074,175","$879,620,923"

In [10]:
#checking the shape of the dataframe.
df_TheNumbers.shape

(5782, 6)

In [11]:
#getting info for dataframe.
df_TheNumbers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [22]:
#Doing some stastical analysis on the dataframe
df_TheNumbers.describe()

                id
count  5782.000000
mean     50.372363
std      28.821076
min       1.000000
25%      25.000000
50%      50.000000
75%      75.000000
max     100.000000

In [12]:
# getting counts for each value in production_budget column
df_TheNumbers['production_budget'].value_counts()

$20,000,000     231
$10,000,000     212
$30,000,000     177
$15,000,000     173
$25,000,000     171
               ...
$6,100,000        1
$9,800,000        1
$104,000,000      1
$2,750,000        1
$730,000          1
Name: production_budget, Length: 509, dtype: int64

In [13]:
# getting counts for each value in release_date column
df_TheNumbers['release_date'].value_counts()

Dec 31, 2014    24
Dec 31, 2015    23
Dec 31, 2010    15
Dec 31, 2008    14
Dec 31, 2009    13
                ..
May 22, 1998     1
May 26, 1995     1
Apr 22, 2010     1
May 14, 2013     1
Aug 8, 2007      1
Name: release_date, Length: 2418, dtype: int64

## **2. Rotten Tomatoes Dataset.**

In [55]:
# reading the file
df_RottenTomatoes = pd.read_csv("datasets/rt.movie_info.tsv", sep="\t")
#displaying the first ten rows of the dataframe.
df_RottenTomatoes.head(10)

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN
5,8,The year is 1942. As the Allies unite overseas...,PG,Drama|Kids and Family,Jay Russell,Gail Gilchriest,"Mar 3, 2000","Jul 11, 2000",NaN,NaN,95 minutes,Warner Bros. Pictures
6,10,Some cast and crew from NBC's highly acclaimed...,PG-13,Comedy,Jake Kasdan,Mike White,"Jan 11, 2002","Jun 18, 2002",$,"41,032,915",82 minutes,Paramount Pictures
7,13,"Stewart Kane, an Irishman living in the Austra...",R,Drama,Ray Lawrence,Raymond Carver|Beatrix Christian,"Apr 27, 2006","Oct 2, 2007",$,"224,114",123 minutes,Sony Pictures Classics
8,14,"""Love Ranch"" is a bittersweet love story that ...",R,Drama,Taylor Hackford,Mark Jacobson,"Jun 30, 2010","Nov 9, 2010",$,"134,904",117 minutes,NaN
9,15,When a diamond expedition in the Congo is lost...,PG-13,Action and Adventure|Mystery and Suspense|Scie...,Frank Marshall,John Patrick Shanley,"Jun 9, 1995","Jul 27, 1999",NaN,NaN,108 minutes,NaN

In [44]:
#checking the shape of the dataframe.
df_RottenTomatoes.shape

(1560, 12)

In [45]:
#getting info for dataframe.
df_RottenTomatoes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

In [46]:
df_RottenTomatoes.describe()

                id
count  1560.000000
mean   1007.303846
std     579.164527
min       1.000000
25%     504.750000
50%    1007.500000
75%    1503.250000
max    2000.000000

In [47]:
# getting counts for each value in rating column
df_RottenTomatoes['rating'].value_counts()

R        521
NR       503
PG       240
PG-13    235
G         57
NC17       1
Name: rating, dtype: int64

In [48]:
# getting counts for each value in genre column
df_RottenTomatoes['genre'].value_counts()

Drama                                                              151
Comedy                                                             110
Comedy|Drama                                                        80
Drama|Mystery and Suspense                                          67
Art House and International|Drama                                   62
                                                                  ...
Classics|Comedy|Mystery and Suspense                                 1
Classics|Drama|Musical and Performing Arts|Mystery and Suspense      1
Comedy|Drama|Science Fiction and Fantasy|Romance                     1
Classics|Science Fiction and Fantasy                                 1
Classics|Comedy|Drama|Kids and Family                                1
Name: genre, Length: 299, dtype: int64